fonecmid-diplom/src/Documents/ВКМ_НачислениеЗаработнойПлаты/ВКМ_НачислениеЗаработнойПлаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеЗаработнойПлаты</name>
  <comment>Расчет оклада, отпуска, процента от работ и НДФЛ за месяц.</comment>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <attributes>
    <name>ПериодРегистрации</name>
    <comment>Месяц, за который выполняется расчет.</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ОсновныеНачисления</name>
  <comment>Результаты расчета оклада и отпуска.</comment>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</chartOfCalculationTypes>
  <schedule>InformationRegister.ВКМ_ГрафикРаботы</schedule>
  <scheduleValue>InformationRegister.ВКМ_ГрафикРаботы.Resource.Значение</scheduleValue>
  <scheduleDate>InformationRegister.ВКМ_ГрафикРаботы.Dimension.Дата</scheduleDate>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ДополнительныеНачисления/ВКМ_ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ДополнительныеНачисления</name>
  <comment>Результаты расчета процента от работ и премий.</comment>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_Удержания/ВКМ_Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_Удержания</name>
  <comment>Результаты расчета НДФЛ.</comment>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <comment>Задолженность предприятия перед сотрудниками: приход - начисление, расход - выплата.</comment>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <comment>Оклад и процент от выполненных работ, действующие с указанного месяца.</comment>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ЗапланированныеОтпуска/ВКМ_ЗапланированныеОтпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ЗапланированныеОтпуска</name>
  <comment>Плановые дни отпуска по графику. Нужен для отчета о расходе запланированных отпусков: отчеты строятся по регистрам, а не по документам.</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ДнейОтпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>0</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/InformationRegisters/ВКМ_ГрафикРаботы/ВКМ_ГрафикРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ГрафикРаботы</name>
  <comment>Производственный календарь: единица означает рабочий день. Используется как график регистров расчета.</comment>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
        <scale>0</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <comment>Работы, выполненные специалистом, и причитающаяся ему сумма процента от работ.</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/ChartsOfCalculationTypes/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ВКМ_ОсновныеНачисления</name>
  <comment>Начисления с периодом действия: оклад и отпуск. Отпуск вытесняет оклад.</comment>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</baseCalculationTypes>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>Отпуск</name>
      <description>Отпуск</description>
    </items>
  </predefined>
</mdclass:ChartOfCalculationTypes>

fonecmid-diplom/src/Documents/ВКМ_НачислениеЗаработнойПлаты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	НачалоРасчета = НачалоМесяца(ПериодРегистрации);
	КонецРасчета = КонецМесяца(ПериодРегистрации);

	Данные = ВКМ_ДанныеДляРасчета(НачалоРасчета, КонецРасчета);

	ВКМ_НачислитьОклад(Данные, НачалоРасчета, КонецРасчета);
	ВКМ_НачислитьОтпуска(Данные, НачалоРасчета, КонецРасчета);
	ВКМ_НачислитьПроцентОтРабот(Данные, НачалоРасчета);
	ВКМ_УдержатьНДФЛ(НачалоРасчета);
	ВКМ_СформироватьВзаиморасчеты();

	Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Движения.ВКМ_Удержания.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получает исходные данные расчета одним пакетным запросом: условия оплаты,
// плановые отпуска месяца, выполненные работы и базу среднего заработка.
//
// Параметры:
//  НачалоРасчета - Дата - начало расчетного месяца.
//  КонецРасчета  - Дата - конец расчетного месяца.
//
// Возвращаемое значение:
//  Структура - исходные данные расчета:
//   * Сотрудники - ТаблицаЗначений - условия оплаты сотрудников.
//   * Отпуска    - ТаблицаЗначений - отпуска, пересекающиеся с месяцем расчета.
//   * Работы     - ТаблицаЗначений - выполненные работы специалистов за месяц.
//   * База       - ТаблицаЗначений - начисления за 12 предшествующих месяцев.
//
Функция ВКМ_ДанныеДляРасчета(НачалоРасчета, КонецРасчета)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Условия.Сотрудник КАК Сотрудник,
		|	Условия.Оклад КАК Оклад,
		|	Условия.ПроцентОтРабот КАК ПроцентОтРабот
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&КонецРасчета, ) КАК Условия
		|;
		|ВЫБРАТЬ
		|	Отпуска.Сотрудник КАК Сотрудник,
		|	Отпуска.Период КАК ДатаНачала,
		|	ДОБАВИТЬКДАТЕ(Отпуска.Период, ДЕНЬ, Отпуска.ДнейОтпуска - 1) КАК ДатаОкончания,
		|	Отпуска.ДнейОтпуска КАК КалендарныхДней
		|ПОМЕСТИТЬ ОтпускаПериода
		|ИЗ
		|	РегистрНакопления.ВКМ_ЗапланированныеОтпуска КАК Отпуска
		|ГДЕ
		|	Отпуска.Активность
		|	И Отпуска.ДнейОтпуска > 0
		|	И Отпуска.Период <= &КонецРасчета
		|	И ДОБАВИТЬКДАТЕ(Отпуска.Период, ДЕНЬ, Отпуска.ДнейОтпуска - 1) >= &НачалоРасчета
		|;
		|ВЫБРАТЬ
		|	ОтпускаПериода.Сотрудник КАК Сотрудник,
		|	ОтпускаПериода.ДатаНачала КАК ДатаНачала,
		|	ОтпускаПериода.ДатаОкончания КАК ДатаОкончания,
		|	ОтпускаПериода.КалендарныхДней КАК КалендарныхДней,
		|	ЕСТЬNULL(СУММА(График.Значение), 0) КАК РабочихДнейОтпуска
		|ИЗ
		|	ОтпускаПериода КАК ОтпускаПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_ГрафикРаботы КАК График
		|		ПО График.Дата МЕЖДУ ОтпускаПериода.ДатаНачала И ОтпускаПериода.ДатаОкончания
		|			И График.Дата МЕЖДУ &НачалоРасчета И &КонецРасчета
		|ГДЕ
		|	ОтпускаПериода.ДатаОкончания >= &НачалоРасчета
		|	И ОтпускаПериода.ДатаНачала <= &КонецРасчета
		|СГРУППИРОВАТЬ ПО
		|	ОтпускаПериода.Сотрудник,
		|	ОтпускаПериода.ДатаНачала,
		|	ОтпускаПериода.ДатаОкончания,
		|	ОтпускаПериода.КалендарныхДней
		|;
		|ВЫБРАТЬ
		|	Работы.Сотрудник КАК Сотрудник,
		|	Работы.СуммаКОплатеОборот КАК СуммаКОплате
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(
		|			&НачалоРасчета,
		|			&КонецРасчета,
		|			Регистратор,
		|			) КАК Работы
		|ГДЕ
		|	Работы.СуммаКОплатеОборот <> 0
		|;
		|ВЫБРАТЬ
		|	Начисления.Сотрудник КАК Сотрудник,
		|	СУММА(Начисления.Результат) КАК СуммаНачислений
		|ИЗ
		|	(ВЫБРАТЬ
		|		Основные.Сотрудник КАК Сотрудник,
		|		Основные.Результат КАК Результат
		|	ИЗ
		|		РегистрРасчета.ВКМ_ОсновныеНачисления КАК Основные
		|	ГДЕ
		|		Основные.ПериодРегистрации МЕЖДУ &НачалоБазы И &КонецБазы
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		Дополнительные.Сотрудник,
		|		Дополнительные.Результат
		|	ИЗ
		|		РегистрРасчета.ВКМ_ДополнительныеНачисления КАК Дополнительные
		|	ГДЕ
		|		Дополнительные.ПериодРегистрации МЕЖДУ &НачалоБазы И &КонецБазы) КАК Начисления
		|СГРУППИРОВАТЬ ПО
		|	Начисления.Сотрудник";

	Запрос.УстановитьПараметр("НачалоРасчета", НачалоРасчета);
	Запрос.УстановитьПараметр("КонецРасчета", КонецРасчета);
	Запрос.УстановитьПараметр("НачалоБазы", ДобавитьМесяц(НачалоРасчета, -12));
	Запрос.УстановитьПараметр("КонецБазы", КонецМесяца(ДобавитьМесяц(НачалоРасчета, -1)));

	Результаты = Запрос.ВыполнитьПакет();

	Данные = Новый Структура;
	Данные.Вставить("Сотрудники", Результаты[0].Выгрузить(ОбходРезультатаЗапроса.Прямой));
	Данные.Вставить("Отпуска", Результаты[2].Выгрузить(ОбходРезультатаЗапроса.Прямой));
	Данные.Вставить("Работы", Результаты[3].Выгрузить(ОбходРезультатаЗапроса.Прямой));
	Данные.Вставить("База", Результаты[4].Выгрузить(ОбходРезультатаЗапроса.Прямой));

	Возврат Данные;

КонецФункции

// Начисляет оклад пропорционально отработанным рабочим дням месяца.
// Рабочие дни, попавшие в отпуск, из нормы исключаются: это соответствует
// вытеснению оклада отпуском, заданному в плане видов расчета.
//
// Параметры:
//  Данные        - см. ВКМ_ДанныеДляРасчета
//  НачалоРасчета - Дата - начало расчетного месяца.
//  КонецРасчета  - Дата - конец расчетного месяца.
//
Процедура ВКМ_НачислитьОклад(Данные, НачалоРасчета, КонецРасчета)

	НормаДней = ВКМ_РасчетЗарплаты.РабочихДнейВПериоде(НачалоРасчета, КонецРасчета);
	Если НормаДней = 0 Тогда
		Возврат;
	КонецЕсли;

	ОтпускаПоСотрудникам = Данные.Отпуска.Скопировать();
	ОтпускаПоСотрудникам.Свернуть("Сотрудник", "РабочихДнейОтпуска");

	Для Каждого СтрокаУсловий Из Данные.Сотрудники Цикл

		Если СтрокаУсловий.Оклад = 0 Тогда
			Продолжить;
		КонецЕсли;

		НайденныеОтпуска = ОтпускаПоСотрудникам.НайтиСтроки(
			Новый Структура("Сотрудник", СтрокаУсловий.Сотрудник));
		ДнейОтпуска = ?(НайденныеОтпуска.Количество() > 0,
			НайденныеОтпуска[0].РабочихДнейОтпуска, 0);

		ОтработаноДней = НормаДней - ДнейОтпуска;
		Если ОтработаноДней <= 0 Тогда
			Продолжить;
		КонецЕсли;

		Начисление = Движения.ВКМ_ОсновныеНачисления.Добавить();
		Начисление.ПериодРегистрации = НачалоРасчета;
		Начисление.ПериодДействияНачало = НачалоРасчета;
		Начисление.ПериодДействияКонец = КонецРасчета;
		Начисление.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад;
		Начисление.Сотрудник = СтрокаУсловий.Сотрудник;
		Начисление.Результат = Окр(СтрокаУсловий.Оклад * ОтработаноДней / НормаДней, 2);

	КонецЦикла;

КонецПроцедуры

// Начисляет отпускные по среднедневному заработку за 12 месяцев,
// предшествующих месяцу расчета.
//
// Параметры:
//  Данные        - см. ВКМ_ДанныеДляРасчета
//  НачалоРасчета - Дата - начало расчетного месяца.
//  КонецРасчета  - Дата - конец расчетного месяца.
//
Процедура ВКМ_НачислитьОтпуска(Данные, НачалоРасчета, КонецРасчета)

	РабочихДнейБазы = ВКМ_РасчетЗарплаты.РабочихДнейВПериоде(
		ДобавитьМесяц(НачалоРасчета, -12), КонецМесяца(ДобавитьМесяц(НачалоРасчета, -1)));

	Для Каждого СтрокаОтпуска Из Данные.Отпуска Цикл

		НайденнаяБаза = Данные.База.НайтиСтроки(
			Новый Структура("Сотрудник", СтрокаОтпуска.Сотрудник));
		СуммаБазы = ?(НайденнаяБаза.Количество() > 0, НайденнаяБаза[0].СуммаНачислений, 0);

		// Даже неоплаченный отпуск должен вытеснять оклад по периоду действия.
		Среднедневной = ?(РабочихДнейБазы = 0, 0, СуммаБазы / РабочихДнейБазы);

		Начисление = Движения.ВКМ_ОсновныеНачисления.Добавить();
		Начисление.ПериодРегистрации = НачалоРасчета;
		Начисление.ПериодДействияНачало = Макс(СтрокаОтпуска.ДатаНачала, НачалоРасчета);
		Начисление.ПериодДействияКонец = Мин(КонецДня(СтрокаОтпуска.ДатаОкончания), КонецРасчета);
		Начисление.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск;
		Начисление.Сотрудник = СтрокаОтпуска.Сотрудник;
		// В каждом месяце оплачивается только попавшая в него часть отпуска.
		КалендарныхДнейМесяца = (НачалоДня(Начисление.ПериодДействияКонец)
			- НачалоДня(Начисление.ПериодДействияНачало)) / 86400 + 1;
		Начисление.Результат = Окр(Среднедневной * КалендарныхДнейМесяца, 2);

	КонецЦикла;

КонецПроцедуры

// Начисляет специалистам процент от выполненных работ. Сумма уже рассчитана
// документами обслуживания с учетом процента, установленного сотруднику.
//
// Параметры:
//  Данные        - см. ВКМ_ДанныеДляРасчета
//  НачалоРасчета - Дата - начало расчетного месяца.
//
Процедура ВКМ_НачислитьПроцентОтРабот(Данные, НачалоРасчета)

	Для Каждого СтрокаРабот Из Данные.Работы Цикл

		Начисление = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Начисление.ПериодРегистрации = НачалоРасчета;
		Начисление.ВидРасчета =
			ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПроцентОтВыполненныхРабот;
		Начисление.Сотрудник = СтрокаРабот.Сотрудник;
		Начисление.Результат = СтрокаРабот.СуммаКОплате;

	КонецЦикла;

КонецПроцедуры

// Удерживает НДФЛ с начислений, зарегистрированных этим документом.
//
// Параметры:
//  НачалоРасчета - Дата - начало расчетного месяца.
//
Процедура ВКМ_УдержатьНДФЛ(НачалоРасчета)

	НачисленоПоСотрудникам = ВКМ_НачисленоПоСотрудникам();

	Для Каждого СтрокаНачислений Из НачисленоПоСотрудникам Цикл

		СуммаНДФЛ = ВКМ_РасчетЗарплаты.РассчитатьНДФЛ(СтрокаНачислений.Значение);
		Если СуммаНДФЛ = 0 Тогда
			Продолжить;
		КонецЕсли;

		Удержание = Движения.ВКМ_Удержания.Добавить();
		Удержание.ПериодРегистрации = НачалоРасчета;
		Удержание.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Удержание.Сотрудник = СтрокаНачислений.Ключ;
		Удержание.Результат = СуммаНДФЛ;

	КонецЦикла;

КонецПроцедуры

// Формирует движения по взаиморасчетам с сотрудниками:
// начислено этим документом минус удержано этим же документом.
//
Процедура ВКМ_СформироватьВзаиморасчеты()

	НачисленоПоСотрудникам = ВКМ_НачисленоПоСотрудникам();

	УдержаноПоСотрудникам = Новый Соответствие;
	Для Каждого Удержание Из Движения.ВКМ_Удержания Цикл
		Текущее = УдержаноПоСотрудникам.Получить(Удержание.Сотрудник);
		УдержаноПоСотрудникам.Вставить(Удержание.Сотрудник,
			?(Текущее = Неопределено, 0, Текущее) + Удержание.Результат);
	КонецЦикла;

	Для Каждого СтрокаНачислений Из НачисленоПоСотрудникам Цикл

		Удержано = УдержаноПоСотрудникам.Получить(СтрокаНачислений.Ключ);
		Сумма = СтрокаНачислений.Значение - ?(Удержано = Неопределено, 0, Удержано);

		Если Сумма = 0 Тогда
			Продолжить;
		КонецЕсли;

		Взаиморасчеты = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Взаиморасчеты.ВидДвижения = ВидДвиженияНакопления.Приход;
		Взаиморасчеты.Период = Дата;
		Взаиморасчеты.Сотрудник = СтрокаНачислений.Ключ;
		Взаиморасчеты.Сумма = Сумма;

	КонецЦикла;

КонецПроцедуры

// Собирает начисленные этим документом суммы в разрезе сотрудников.
//
// Возвращаемое значение:
//  Соответствие - ключ: СправочникСсылка.ВКМ_Сотрудники, значение: Число.
//
Функция ВКМ_НачисленоПоСотрудникам()

	Результат = Новый Соответствие;

	Для Каждого Начисление Из Движения.ВКМ_ОсновныеНачисления Цикл
		Текущее = Результат.Получить(Начисление.Сотрудник);
		Результат.Вставить(Начисление.Сотрудник,
			?(Текущее = Неопределено, 0, Текущее) + Начисление.Результат);
	КонецЦикла;

	Для Каждого Начисление Из Движения.ВКМ_ДополнительныеНачисления Цикл
		Текущее = Результат.Получить(Начисление.Сотрудник);
		Результат.Вставить(Начисление.Сотрудник,
			?(Текущее = Неопределено, 0, Текущее) + Начисление.Результат);
	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецЕсли
